Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/include/pio/pic32cx5112mtc128s1.h
#define MUX_PA31A_SLCDC_SEG2                       _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG2 */
#define PIO_PA31A_SLCDC_SEG2                       (_UINT32_(1) << 31) /**< SLCDC signal: SLCDC_SEG2 */
#define PIN_PB0A_SLCDC_SEG3                        _UINT32_(32) /**< SLCDC signal: SLCDC_SEG3 on PB0 mux A */
#define MUX_PB0A_SLCDC_SEG3                        _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG3 */
#define PIO_PB0A_SLCDC_SEG3                        (_UINT32_(1) << 0) /**< SLCDC signal: SLCDC_SEG3 */
#define PIN_PB1A_SLCDC_SEG4                        _UINT32_(33) /**< SLCDC signal: SLCDC_SEG4 on PB1 mux A */
#define MUX_PB1A_SLCDC_SEG4                        _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG4 */
#define PIO_PB1A_SLCDC_SEG4                        (_UINT32_(1) << 1) /**< SLCDC signal: SLCDC_SEG4 */
#define PIN_PB2A_SLCDC_SEG5                        _UINT32_(34) /**< SLCDC signal: SLCDC_SEG5 on PB2 mux A */
#define MUX_PB2A_SLCDC_SEG5                        _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG5 */
#define PIO_PB2A_SLCDC_SEG5                        (_UINT32_(1) << 2) /**< SLCDC signal: SLCDC_SEG5 */
#define PIN_PB3A_SLCDC_SEG6                        _UINT32_(35) /**< SLCDC signal: SLCDC_SEG6 on PB3 mux A */
#define MUX_PB3A_SLCDC_SEG6                        _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG6 */
#define PIO_PB3A_SLCDC_SEG6                        (_UINT32_(1) << 3) /**< SLCDC signal: SLCDC_SEG6 */
#define PIN_PB4A_SLCDC_SEG7                        _UINT32_(36) /**< SLCDC signal: SLCDC_SEG7 on PB4 mux A */
#define MUX_PB4A_SLCDC_SEG7                        _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG7 */
#define PIO_PB4A_SLCDC_SEG7                        (_UINT32_(1) << 4) /**< SLCDC signal: SLCDC_SEG7 */
#define PIN_PB5A_SLCDC_SEG8                        _UINT32_(37) /**< SLCDC signal: SLCDC_SEG8 on PB5 mux A */
#define MUX_PB5A_SLCDC_SEG8                        _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG8 */
#define PIO_PB5A_SLCDC_SEG8                        (_UINT32_(1) << 5) /**< SLCDC signal: SLCDC_SEG8 */
#define PIN_PB6A_SLCDC_SEG9                        _UINT32_(38) /**< SLCDC signal: SLCDC_SEG9 on PB6 mux A */
#define MUX_PB6A_SLCDC_SEG9                        _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG9 */
#define PIO_PB6A_SLCDC_SEG9                        (_UINT32_(1) << 6) /**< SLCDC signal: SLCDC_SEG9 */
#define PIN_PB7A_SLCDC_SEG10                       _UINT32_(39) /**< SLCDC signal: SLCDC_SEG10 on PB7 mux A */
#define MUX_PB7A_SLCDC_SEG10                       _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG10 */
#define PIO_PB7A_SLCDC_SEG10                       (_UINT32_(1) << 7) /**< SLCDC signal: SLCDC_SEG10 */
#define PIN_PB8A_SLCDC_SEG11                       _UINT32_(40) /**< SLCDC signal: SLCDC_SEG11 on PB8 mux A */
#define MUX_PB8A_SLCDC_SEG11                       _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG11 */
#define PIO_PB8A_SLCDC_SEG11                       (_UINT32_(1) << 8) /**< SLCDC signal: SLCDC_SEG11 */
#define PIN_PB9A_SLCDC_SEG12                       _UINT32_(41) /**< SLCDC signal: SLCDC_SEG12 on PB9 mux A */
#define MUX_PB9A_SLCDC_SEG12                       _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG12 */
#define PIO_PB9A_SLCDC_SEG12                       (_UINT32_(1) << 9) /**< SLCDC signal: SLCDC_SEG12 */
#define PIN_PB10A_SLCDC_SEG13                      _UINT32_(42) /**< SLCDC signal: SLCDC_SEG13 on PB10 mux A */
#define MUX_PB10A_SLCDC_SEG13                      _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG13 */
#define PIO_PB10A_SLCDC_SEG13                      (_UINT32_(1) << 10) /**< SLCDC signal: SLCDC_SEG13 */
#define PIN_PB11A_SLCDC_SEG14                      _UINT32_(43) /**< SLCDC signal: SLCDC_SEG14 on PB11 mux A */
#define MUX_PB11A_SLCDC_SEG14                      _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG14 */
#define PIO_PB11A_SLCDC_SEG14                      (_UINT32_(1) << 11) /**< SLCDC signal: SLCDC_SEG14 */
#define PIN_PB12A_SLCDC_SEG15                      _UINT32_(44) /**< SLCDC signal: SLCDC_SEG15 on PB12 mux A */
#define MUX_PB12A_SLCDC_SEG15                      _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG15 */
#define PIO_PB12A_SLCDC_SEG15                      (_UINT32_(1) << 12) /**< SLCDC signal: SLCDC_SEG15 */
#define PIN_PB13A_SLCDC_SEG16                      _UINT32_(45) /**< SLCDC signal: SLCDC_SEG16 on PB13 mux A */
#define MUX_PB13A_SLCDC_SEG16                      _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG16 */
#define PIO_PB13A_SLCDC_SEG16                      (_UINT32_(1) << 13) /**< SLCDC signal: SLCDC_SEG16 */
#define PIN_PB14A_SLCDC_SEG17                      _UINT32_(46) /**< SLCDC signal: SLCDC_SEG17 on PB14 mux A */
#define MUX_PB14A_SLCDC_SEG17                      _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG17 */
#define PIO_PB14A_SLCDC_SEG17                      (_UINT32_(1) << 14) /**< SLCDC signal: SLCDC_SEG17 */
#define PIN_PB15A_SLCDC_SEG18                      _UINT32_(47) /**< SLCDC signal: SLCDC_SEG18 on PB15 mux A */
#define MUX_PB15A_SLCDC_SEG18                      _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG18 */
#define PIO_PB15A_SLCDC_SEG18                      (_UINT32_(1) << 15) /**< SLCDC signal: SLCDC_SEG18 */
#define PIN_PB16A_SLCDC_SEG19                      _UINT32_(48) /**< SLCDC signal: SLCDC_SEG19 on PB16 mux A */
#define MUX_PB16A_SLCDC_SEG19                      _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG19 */
#define PIO_PB16A_SLCDC_SEG19                      (_UINT32_(1) << 16) /**< SLCDC signal: SLCDC_SEG19 */
#define PIN_PB17A_SLCDC_SEG20                      _UINT32_(49) /**< SLCDC signal: SLCDC_SEG20 on PB17 mux A */
#define MUX_PB17A_SLCDC_SEG20                      _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG20 */
#define PIO_PB17A_SLCDC_SEG20                      (_UINT32_(1) << 17) /**< SLCDC signal: SLCDC_SEG20 */
#define PIN_PB18A_SLCDC_SEG21                      _UINT32_(50) /**< SLCDC signal: SLCDC_SEG21 on PB18 mux A */
#define MUX_PB18A_SLCDC_SEG21                      _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG21 */
#define PIO_PB18A_SLCDC_SEG21                      (_UINT32_(1) << 18) /**< SLCDC signal: SLCDC_SEG21 */
#define PIN_PB19A_SLCDC_SEG22                      _UINT32_(51) /**< SLCDC signal: SLCDC_SEG22 on PB19 mux A */
#define MUX_PB19A_SLCDC_SEG22                      _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG22 */
#define PIO_PB19A_SLCDC_SEG22                      (_UINT32_(1) << 19) /**< SLCDC signal: SLCDC_SEG22 */
#define PIN_PB20A_SLCDC_SEG23                      _UINT32_(52) /**< SLCDC signal: SLCDC_SEG23 on PB20 mux A */
#define MUX_PB20A_SLCDC_SEG23                      _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG23 */
#define PIO_PB20A_SLCDC_SEG23                      (_UINT32_(1) << 20) /**< SLCDC signal: SLCDC_SEG23 */
#define PIN_PB21A_SLCDC_SEG24                      _UINT32_(53) /**< SLCDC signal: SLCDC_SEG24 on PB21 mux A */
#define MUX_PB21A_SLCDC_SEG24                      _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG24 */
#define PIO_PB21A_SLCDC_SEG24                      (_UINT32_(1) << 21) /**< SLCDC signal: SLCDC_SEG24 */
#define PIN_PB22A_SLCDC_SEG25                      _UINT32_(54) /**< SLCDC signal: SLCDC_SEG25 on PB22 mux A */
#define MUX_PB22A_SLCDC_SEG25                      _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG25 */
#define PIO_PB22A_SLCDC_SEG25                      (_UINT32_(1) << 22) /**< SLCDC signal: SLCDC_SEG25 */
#define PIN_PB23A_SLCDC_SEG26                      _UINT32_(55) /**< SLCDC signal: SLCDC_SEG26 on PB23 mux A */
#define MUX_PB23A_SLCDC_SEG26                      _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG26 */
#define PIO_PB23A_SLCDC_SEG26                      (_UINT32_(1) << 23) /**< SLCDC signal: SLCDC_SEG26 */
#define PIN_PB24A_SLCDC_SEG27                      _UINT32_(56) /**< SLCDC signal: SLCDC_SEG27 on PB24 mux A */
#define MUX_PB24A_SLCDC_SEG27                      _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG27 */
#define PIO_PB24A_SLCDC_SEG27                      (_UINT32_(1) << 24) /**< SLCDC signal: SLCDC_SEG27 */
#define PIN_PB25A_SLCDC_SEG28                      _UINT32_(57) /**< SLCDC signal: SLCDC_SEG28 on PB25 mux A */
#define MUX_PB25A_SLCDC_SEG28                      _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG28 */
#define PIO_PB25A_SLCDC_SEG28                      (_UINT32_(1) << 25) /**< SLCDC signal: SLCDC_SEG28 */
#define PIN_PB26A_SLCDC_SEG29                      _UINT32_(58) /**< SLCDC signal: SLCDC_SEG29 on PB26 mux A */
#define MUX_PB26A_SLCDC_SEG29                      _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG29 */
#define PIO_PB26A_SLCDC_SEG29                      (_UINT32_(1) << 26) /**< SLCDC signal: SLCDC_SEG29 */
#define PIN_PC0A_SLCDC_SEG30                       _UINT32_(64) /**< SLCDC signal: SLCDC_SEG30 on PC0 mux A */
#define MUX_PC0A_SLCDC_SEG30                       _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG30 */
#define PIO_PC0A_SLCDC_SEG30                       (_UINT32_(1) << 0) /**< SLCDC signal: SLCDC_SEG30 */
#define PIN_PC1A_SLCDC_SEG31                       _UINT32_(65) /**< SLCDC signal: SLCDC_SEG31 on PC1 mux A */
#define MUX_PC1A_SLCDC_SEG31                       _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG31 */
#define PIO_PC1A_SLCDC_SEG31                       (_UINT32_(1) << 1) /**< SLCDC signal: SLCDC_SEG31 */
/* ========== PIO definition for SUPC peripheral ========== */
#define PIN_PA2X1_SUPC_WKUP3                       _UINT32_(2)  /**< SUPC signal: SUPC_WKUP3 on PA2 mux X1 */
#define PIO_PA2X1_SUPC_WKUP3                       (_UINT32_(1) << 2) /**< SUPC signal: SUPC_WKUP3 */
#define PIN_PA3X1_SUPC_WKUP4                       _UINT32_(3)  /**< SUPC signal: SUPC_WKUP4 on PA3 mux X1 */
#define PIO_PA3X1_SUPC_WKUP4                       (_UINT32_(1) << 3) /**< SUPC signal: SUPC_WKUP4 */
#define PIN_PA5X1_SUPC_WKUP5                       _UINT32_(5)  /**< SUPC signal: SUPC_WKUP5 on PA5 mux X1 */
#define PIO_PA5X1_SUPC_WKUP5                       (_UINT32_(1) << 5) /**< SUPC signal: SUPC_WKUP5 */
#define PIN_PA9X1_SUPC_WKUP6                       _UINT32_(9)  /**< SUPC signal: SUPC_WKUP6 on PA9 mux X1 */
#define PIO_PA9X1_SUPC_WKUP6                       (_UINT32_(1) << 9) /**< SUPC signal: SUPC_WKUP6 */
#define PIN_PA13X1_SUPC_WKUP7                      _UINT32_(13) /**< SUPC signal: SUPC_WKUP7 on PA13 mux X1 */
#define PIO_PA13X1_SUPC_WKUP7                      (_UINT32_(1) << 13) /**< SUPC signal: SUPC_WKUP7 */
#define PIN_PB25X1_SUPC_WKUP8                      _UINT32_(57) /**< SUPC signal: SUPC_WKUP8 on PB25 mux X1 */
#define PIO_PB25X1_SUPC_WKUP8                      (_UINT32_(1) << 25) /**< SUPC signal: SUPC_WKUP8 */
#define PIN_PB9X1_SUPC_WKUP9                       _UINT32_(41) /**< SUPC signal: SUPC_WKUP9 on PB9 mux X1 */
#define PIO_PB9X1_SUPC_WKUP9                       (_UINT32_(1) << 9) /**< SUPC signal: SUPC_WKUP9 */
#define PIN_PB12X1_SUPC_WKUP10                     _UINT32_(44) /**< SUPC signal: SUPC_WKUP10 on PB12 mux X1 */
#define PIO_PB12X1_SUPC_WKUP10                     (_UINT32_(1) << 12) /**< SUPC signal: SUPC_WKUP10 */
#define PIN_PC7X1_SUPC_WKUP11                      _UINT32_(71) /**< SUPC signal: SUPC_WKUP11 on PC7 mux X1 */
#define PIO_PC7X1_SUPC_WKUP11                      (_UINT32_(1) << 7) /**< SUPC signal: SUPC_WKUP11 */
#define PIN_PC9X1_SUPC_WKUP12                      _UINT32_(73) /**< SUPC signal: SUPC_WKUP12 on PC9 mux X1 */
#define PIO_PC9X1_SUPC_WKUP12                      (_UINT32_(1) << 9) /**< SUPC signal: SUPC_WKUP12 */
#define PIN_PC14X1_SUPC_WKUP13                     _UINT32_(78) /**< SUPC signal: SUPC_WKUP13 on PC14 mux X1 */
#define PIO_PC14X1_SUPC_WKUP13                     (_UINT32_(1) << 14) /**< SUPC signal: SUPC_WKUP13 */
#define PIN_PC21X1_SUPC_WKUP14                     _UINT32_(85) /**< SUPC signal: SUPC_WKUP14 on PC21 mux X1 */
#define PIO_PC21X1_SUPC_WKUP14                     (_UINT32_(1) << 21) /**< SUPC signal: SUPC_WKUP14 */
/* ========== PIO definition for TC0 peripheral ========== */
#define PIN_PA23D_TC0_TCLK0                        _UINT32_(23) /**< TC0 signal: TC0_TCLK0 on PA23 mux D */
#define MUX_PA23D_TC0_TCLK0                        _UINT32_(3)  /**< TC0 signal line function value: TC0_TCLK0 */
#define PIO_PA23D_TC0_TCLK0                        (_UINT32_(1) << 23) /**< TC0 signal: TC0_TCLK0 */
#define PIN_PB1D_TC0_TCLK1                         _UINT32_(33) /**< TC0 signal: TC0_TCLK1 on PB1 mux D */
#define MUX_PB1D_TC0_TCLK1                         _UINT32_(3)  /**< TC0 signal line function value: TC0_TCLK1 */
#define PIO_PB1D_TC0_TCLK1                         (_UINT32_(1) << 1) /**< TC0 signal: TC0_TCLK1 */
#define PIN_PB4D_TC0_TCLK2                         _UINT32_(36) /**< TC0 signal: TC0_TCLK2 on PB4 mux D */
#define MUX_PB4D_TC0_TCLK2                         _UINT32_(3)  /**< TC0 signal line function value: TC0_TCLK2 */
#define PIO_PB4D_TC0_TCLK2                         (_UINT32_(1) << 4) /**< TC0 signal: TC0_TCLK2 */
#define PIN_PA2B_TC0_TIOA0                         _UINT32_(2)  /**< TC0 signal: TC0_TIOA0 on PA2 mux B */
#define MUX_PA2B_TC0_TIOA0                         _UINT32_(1)  /**< TC0 signal line function value: TC0_TIOA0 */
#define PIO_PA2B_TC0_TIOA0                         (_UINT32_(1) << 2) /**< TC0 signal: TC0_TIOA0 */
#define PIN_PA25D_TC0_TIOA0                        _UINT32_(25) /**< TC0 signal: TC0_TIOA0 on PA25 mux D */
#define MUX_PA25D_TC0_TIOA0                        _UINT32_(3)  /**< TC0 signal line function value: TC0_TIOA0 */
#define PIO_PA25D_TC0_TIOA0                        (_UINT32_(1) << 25) /**< TC0 signal: TC0_TIOA0 */
#define PIN_PA31D_TC0_TIOA1                        _UINT32_(31) /**< TC0 signal: TC0_TIOA1 on PA31 mux D */
#define MUX_PA31D_TC0_TIOA1                        _UINT32_(3)  /**< TC0 signal line function value: TC0_TIOA1 */
#define PIO_PA31D_TC0_TIOA1                        (_UINT32_(1) << 31) /**< TC0 signal: TC0_TIOA1 */
#define PIN_PB2D_TC0_TIOA2                         _UINT32_(34) /**< TC0 signal: TC0_TIOA2 on PB2 mux D */
#define MUX_PB2D_TC0_TIOA2                         _UINT32_(3)  /**< TC0 signal line function value: TC0_TIOA2 */
#define PIO_PB2D_TC0_TIOA2                         (_UINT32_(1) << 2) /**< TC0 signal: TC0_TIOA2 */
#define PIN_PA3A_TC0_TIOB0                         _UINT32_(3)  /**< TC0 signal: TC0_TIOB0 on PA3 mux A */
#define MUX_PA3A_TC0_TIOB0                         _UINT32_(0)  /**< TC0 signal line function value: TC0_TIOB0 */
#define PIO_PA3A_TC0_TIOB0                         (_UINT32_(1) << 3) /**< TC0 signal: TC0_TIOB0 */
#define PIN_PA24D_TC0_TIOB0                        _UINT32_(24) /**< TC0 signal: TC0_TIOB0 on PA24 mux D */
#define MUX_PA24D_TC0_TIOB0                        _UINT32_(3)  /**< TC0 signal line function value: TC0_TIOB0 */
#define PIO_PA24D_TC0_TIOB0                        (_UINT32_(1) << 24) /**< TC0 signal: TC0_TIOB0 */
#define PIN_PB0D_TC0_TIOB1                         _UINT32_(32) /**< TC0 signal: TC0_TIOB1 on PB0 mux D */
#define MUX_PB0D_TC0_TIOB1                         _UINT32_(3)  /**< TC0 signal line function value: TC0_TIOB1 */
#define PIO_PB0D_TC0_TIOB1                         (_UINT32_(1) << 0) /**< TC0 signal: TC0_TIOB1 */
#define PIN_PB3D_TC0_TIOB2                         _UINT32_(35) /**< TC0 signal: TC0_TIOB2 on PB3 mux D */
#define MUX_PB3D_TC0_TIOB2                         _UINT32_(3)  /**< TC0 signal line function value: TC0_TIOB2 */
#define PIO_PB3D_TC0_TIOB2                         (_UINT32_(1) << 3) /**< TC0 signal: TC0_TIOB2 */
/* ========== PIO definition for TC1 peripheral ========== */
#define PIN_PB14C_TC1_TCLK3                        _UINT32_(46) /**< TC1 signal: TC1_TCLK3 on PB14 mux C */
#define MUX_PB14C_TC1_TCLK3                        _UINT32_(2)  /**< TC1 signal line function value: TC1_TCLK3 */
#define PIO_PB14C_TC1_TCLK3                        (_UINT32_(1) << 14) /**< TC1 signal: TC1_TCLK3 */
#define PIN_PB17C_TC1_TCLK4                        _UINT32_(49) /**< TC1 signal: TC1_TCLK4 on PB17 mux C */
#define MUX_PB17C_TC1_TCLK4                        _UINT32_(2)  /**< TC1 signal line function value: TC1_TCLK4 */
#define PIO_PB17C_TC1_TCLK4                        (_UINT32_(1) << 17) /**< TC1 signal: TC1_TCLK4 */
#define PIN_PC5D_TC1_TCLK5                         _UINT32_(69) /**< TC1 signal: TC1_TCLK5 on PC5 mux D */
#define MUX_PC5D_TC1_TCLK5                         _UINT32_(3)  /**< TC1 signal line function value: TC1_TCLK5 */
#define PIO_PC5D_TC1_TCLK5                         (_UINT32_(1) << 5) /**< TC1 signal: TC1_TCLK5 */
#define PIN_PB8C_TC1_TIOA3                         _UINT32_(40) /**< TC1 signal: TC1_TIOA3 on PB8 mux C */
#define MUX_PB8C_TC1_TIOA3                         _UINT32_(2)  /**< TC1 signal line function value: TC1_TIOA3 */
#define PIO_PB8C_TC1_TIOA3                         (_UINT32_(1) << 8) /**< TC1 signal: TC1_TIOA3 */
#define PIN_PC0C_TC1_TIOA3                         _UINT32_(64) /**< TC1 signal: TC1_TIOA3 on PC0 mux C */
#define MUX_PC0C_TC1_TIOA3                         _UINT32_(2)  /**< TC1 signal line function value: TC1_TIOA3 */
#define PIO_PC0C_TC1_TIOA3                         (_UINT32_(1) << 0) /**< TC1 signal: TC1_TIOA3 */
#define PIN_PB18C_TC1_TIOA4                        _UINT32_(50) /**< TC1 signal: TC1_TIOA4 on PB18 mux C */
#define MUX_PB18C_TC1_TIOA4                        _UINT32_(2)  /**< TC1 signal line function value: TC1_TIOA4 */
#define PIO_PB18C_TC1_TIOA4                        (_UINT32_(1) << 18) /**< TC1 signal: TC1_TIOA4 */
#define PIN_PB5C_TC1_TIOA5                         _UINT32_(37) /**< TC1 signal: TC1_TIOA5 on PB5 mux C */
#define MUX_PB5C_TC1_TIOA5                         _UINT32_(2)  /**< TC1 signal line function value: TC1_TIOA5 */
#define PIO_PB5C_TC1_TIOA5                         (_UINT32_(1) << 5) /**< TC1 signal: TC1_TIOA5 */
#define PIN_PB24C_TC1_TIOA5                        _UINT32_(56) /**< TC1 signal: TC1_TIOA5 on PB24 mux C */
#define MUX_PB24C_TC1_TIOA5                        _UINT32_(2)  /**< TC1 signal line function value: TC1_TIOA5 */
#define PIO_PB24C_TC1_TIOA5                        (_UINT32_(1) << 24) /**< TC1 signal: TC1_TIOA5 */
#define PIN_PB13C_TC1_TIOB3                        _UINT32_(45) /**< TC1 signal: TC1_TIOB3 on PB13 mux C */
#define MUX_PB13C_TC1_TIOB3                        _UINT32_(2)  /**< TC1 signal line function value: TC1_TIOB3 */
#define PIO_PB13C_TC1_TIOB3                        (_UINT32_(1) << 13) /**< TC1 signal: TC1_TIOB3 */
#define PIN_PB19C_TC1_TIOB4                        _UINT32_(51) /**< TC1 signal: TC1_TIOB4 on PB19 mux C */
#define MUX_PB19C_TC1_TIOB4                        _UINT32_(2)  /**< TC1 signal line function value: TC1_TIOB4 */
#define PIO_PB19C_TC1_TIOB4                        (_UINT32_(1) << 19) /**< TC1 signal: TC1_TIOB4 */
#define PIN_PB6C_TC1_TIOB5                         _UINT32_(38) /**< TC1 signal: TC1_TIOB5 on PB6 mux C */
#define MUX_PB6C_TC1_TIOB5                         _UINT32_(2)  /**< TC1 signal line function value: TC1_TIOB5 */
#define PIO_PB6C_TC1_TIOB5                         (_UINT32_(1) << 6) /**< TC1 signal: TC1_TIOB5 */
#define PIN_PB25C_TC1_TIOB5                        _UINT32_(57) /**< TC1 signal: TC1_TIOB5 on PB25 mux C */
#define MUX_PB25C_TC1_TIOB5                        _UINT32_(2)  /**< TC1 signal line function value: TC1_TIOB5 */
#define PIO_PB25C_TC1_TIOB5                        (_UINT32_(1) << 25) /**< TC1 signal: TC1_TIOB5 */
/* ========== PIO definition for TC2 peripheral ========== */
#define PIN_PA10C_TC2_TCLK6                        _UINT32_(10) /**< TC2 signal: TC2_TCLK6 on PA10 mux C */
#define MUX_PA10C_TC2_TCLK6                        _UINT32_(2)  /**< TC2 signal line function value: TC2_TCLK6 */
#define PIO_PA10C_TC2_TCLK6                        (_UINT32_(1) << 10) /**< TC2 signal: TC2_TCLK6 */
#define PIN_PC16D_TC2_TCLK7                        _UINT32_(80) /**< TC2 signal: TC2_TCLK7 on PC16 mux D */
#define MUX_PC16D_TC2_TCLK7                        _UINT32_(3)  /**< TC2 signal line function value: TC2_TCLK7 */
#define PIO_PC16D_TC2_TCLK7                        (_UINT32_(1) << 16) /**< TC2 signal: TC2_TCLK7 */
#define PIN_PC19D_TC2_TCLK8                        _UINT32_(83) /**< TC2 signal: TC2_TCLK8 on PC19 mux D */
#define MUX_PC19D_TC2_TCLK8                        _UINT32_(3)  /**< TC2 signal line function value: TC2_TCLK8 */
#define PIO_PC19D_TC2_TCLK8                        (_UINT32_(1) << 19) /**< TC2 signal: TC2_TCLK8 */
#define PIN_PA6C_TC2_TIOA6                         _UINT32_(6)  /**< TC2 signal: TC2_TIOA6 on PA6 mux C */
#define MUX_PA6C_TC2_TIOA6                         _UINT32_(2)  /**< TC2 signal line function value: TC2_TIOA6 */
#define PIO_PA6C_TC2_TIOA6                         (_UINT32_(1) << 6) /**< TC2 signal: TC2_TIOA6 */
#define PIN_PC14D_TC2_TIOA7                        _UINT32_(78) /**< TC2 signal: TC2_TIOA7 on PC14 mux D */
#define MUX_PC14D_TC2_TIOA7                        _UINT32_(3)  /**< TC2 signal line function value: TC2_TIOA7 */
#define PIO_PC14D_TC2_TIOA7                        (_UINT32_(1) << 14) /**< TC2 signal: TC2_TIOA7 */
#define PIN_PC17D_TC2_TIOA8                        _UINT32_(81) /**< TC2 signal: TC2_TIOA8 on PC17 mux D */
#define MUX_PC17D_TC2_TIOA8                        _UINT32_(3)  /**< TC2 signal line function value: TC2_TIOA8 */
#define PIO_PC17D_TC2_TIOA8                        (_UINT32_(1) << 17) /**< TC2 signal: TC2_TIOA8 */
#define PIN_PA7C_TC2_TIOB6                         _UINT32_(7)  /**< TC2 signal: TC2_TIOB6 on PA7 mux C */
#define MUX_PA7C_TC2_TIOB6                         _UINT32_(2)  /**< TC2 signal line function value: TC2_TIOB6 */
#define PIO_PA7C_TC2_TIOB6                         (_UINT32_(1) << 7) /**< TC2 signal: TC2_TIOB6 */
#define PIN_PC15D_TC2_TIOB7                        _UINT32_(79) /**< TC2 signal: TC2_TIOB7 on PC15 mux D */
#define MUX_PC15D_TC2_TIOB7                        _UINT32_(3)  /**< TC2 signal line function value: TC2_TIOB7 */
#define PIO_PC15D_TC2_TIOB7                        (_UINT32_(1) << 15) /**< TC2 signal: TC2_TIOB7 */
#define PIN_PC18D_TC2_TIOB8                        _UINT32_(82) /**< TC2 signal: TC2_TIOB8 on PC18 mux D */
#define MUX_PC18D_TC2_TIOB8                        _UINT32_(3)  /**< TC2 signal line function value: TC2_TIOB8 */
#define PIO_PC18D_TC2_TIOB8                        (_UINT32_(1) << 18) /**< TC2 signal: TC2_TIOB8 */
/* ========== PIO definition for TC3 peripheral ========== */
#define PIN_PD3A_TC3_TCLK9                         _UINT32_(99) /**< TC3 signal: TC3_TCLK9 on PD3 mux A */
#define MUX_PD3A_TC3_TCLK9                         _UINT32_(0)  /**< TC3 signal line function value: TC3_TCLK9 */
#define PIO_PD3A_TC3_TCLK9                         (_UINT32_(1) << 3) /**< TC3 signal: TC3_TCLK9 */
#define PIN_PD16A_TC3_TCLK10                       _UINT32_(112) /**< TC3 signal: TC3_TCLK10 on PD16 mux A */
#define MUX_PD16A_TC3_TCLK10                       _UINT32_(0)  /**< TC3 signal line function value: TC3_TCLK10 */
#define PIO_PD16A_TC3_TCLK10                       (_UINT32_(1) << 16) /**< TC3 signal: TC3_TCLK10 */
#define PIN_PD19C_TC3_TCLK11                       _UINT32_(115) /**< TC3 signal: TC3_TCLK11 on PD19 mux C */
#define MUX_PD19C_TC3_TCLK11                       _UINT32_(2)  /**< TC3 signal line function value: TC3_TCLK11 */
